# --------------------------------------------------------------------------------------------------------------
# Copyright (c) 2019 Yusuke Kato, All rights reserved.
# ゲームをクリアする前にソースコードを見てはいけない
# --------------------------------------------------------------------------------------------------------------
import json

def main():
    # ステージデータ用配列
    stages = []

    # stage 0
    s000 = {}
    s000['num'] = 0
    s000['t'] = "あなたは見知らぬ部屋で目を覚ました。部屋の中には木でできた机と椅子、太陽の光がさす窓が一つ、そして外へ続く扉がある。なぜ自分がここにいるのか記憶がない。"
    s000['c1'] = "扉を開けて外に出る"
    s000['c2'] = "窓から外をのぞく"
    s000['c3'] = "夢から覚める"
    #print(type(s000))

    stages.append(s000)

    # JSONファイルで書き出し
    fw = open('data.json', 'w')
    json.dump(stages, fw)
    
if __name__=='__main__':
    main()